Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: Returns the keyword for the descriptor at the specified (one-based) position in the receiver.
ja: レシーバの中の指定された位置（１起点）での記述子に対するキーワードを返します。

source: Returns the largest x coordinate of a given rectangle.
ja: 与えられた矩形の最大のx座標を返します。

source: Returns the largest y coordinate of a given rectangle.
ja: 与えられた矩形の最大のy座標を返します。

source: Returns the location of the specified image resource as an NSURL.
ja: 指定された画像リソースの位置をNSURLとして返します。

source: Returns the location of the specified image resource file.
ja: 指定された画像リソースの位置を返します。

source: Returns the location of the specified sound resource file.
ja: 指定されたサウンドリソースファイルの位置を返します。

source: Returns the logon name of the current user.
ja: 現在のユーザのログオン名を返します。

source: Returns the longest possible subsequences of the collection, in order, around elements equal to the given element.
ja: 与えられた要素と等しい要素を避けるようにして、このコレクションの最も長くなりうる下位シーケンスを、順番に返します。

source: Returns the longest possible subsequences of the collection, in order, that don’t contain elements satisfying the given predicate.
ja: 与えられた述部を満たす要素を含んでいない、このコレクションの最も長くなりうる下位シーケンスそれらを順序どおりに返します。

source: Returns the lowest index whose corresponding array value is equal to a given object.
ja: 最も低いインデックスで、それの対応する配列値が指定されたオブジェクトと同等であるものを返します。

source: Returns the lowest index whose corresponding array value is identical to a given object.
ja: 最も低いインデックスで、それの対応する配列値がある与えられたオブジェクトと同一であるものを返します。

source: Returns the lowest index within a specified range whose corresponding array value is equal to a given object .
ja: 指定された範囲内の最も低いインデックスで、それの対応する配列値がある与えられたオブジェクトと同一であるものを返します。

source: Returns the maximum element in the sequence, using the given predicate as the comparison between elements.
ja: シーケンスの中の最大の要素を返します、与えられた述部を要素間の比較として使います。

source: Returns the maximum element in the sequence.
ja: シーケンスの中の最大の要素を返します。

source: Returns the minimum element in the sequence, using the given predicate as the comparison between elements.
ja: シーケンスの中の最小の要素を返します、与えられた述部を要素間の比較として使います。

source: Returns the minimum element in the sequence.
ja: シーケンスの中の最小の要素を返します。

source: Returns the minimum range limits of the values that a given component can take on.
ja: 与えられた構成要素が取ることが可能な値の最小限界範囲。

source: Returns the name of a class as a string.
ja: クラスの名前を文字列として返します。

source: Returns the name of a protocol as a string.
ja: プロトコルの名前を文字列として返します。

source: Returns the name used as by default when publishing NSNet Services.
ja: NSNet Servicesをパブリッシュする場合に省略時として使われる名前を返します。

source: Returns the next hash-table element in the enumeration.
ja: 列挙の中の次のハッシュテーブル要素を返します。

source: Returns the number of accessibility elements in the container.
ja: コンテナの中のアクセシビリティ要素の数を返します。

source: Returns the number of bytes in a page.
ja: あるページの中のバイト数を返します。

source: Returns the number of capture groups in the regular expression.
ja: その正規表現での捕獲グループの数を返します。

source: Returns the number of elements in a hash table.
ja: あるハッシュテーブルの中の要素数を返します。

source: Returns the number of elements in a map table.
ja: あるマップテーブルの中の要素数を返します。

source: Returns the number of matches of the regular expression within the specified range of the string.
ja: この文字列の指定の範囲内における正規表現のマッチ数を返します。

source: Returns the number of ranges.
ja: いくらかある範囲の数を返します。

source: Returns the object at the specified index.
ja: 指定されたインデックスでのオブジェクトを返します。

source: Returns the object located at the specified index.
ja: 指定されたインデックスに位置するオブジェクトを返します。

source: Returns the object returned by copy(with:).
ja: copy(with:)によって返されるオブジェクトを返します。

source: Returns the object returned by copy With Zone:.
ja: copy With Zone:によって返されるオブジェクトを返します。

source: Returns the object returned by mutable Copy(with:) where the zone is nil.
ja: mutable Copy(with:)によって返されるオブジェクトを返します、そこでゾーンはnilです。

source: Returns the object to which unrecognized messages should first be directed.
ja: 有効でないメッセージが最初に向けられるべきオブジェクトを返します。

source: Returns the options used when the regular expression option was created.
ja: 正規表現オプションが作成された時に使用されたオプションを返します。

source: Returns the path of the directory or file that a symbolic link at a given path refers to.
ja: 与えられたパスでのシンボリックリンクが参照するディレクトリまたはファイルのパスを返します。

source: Returns the path of the item pointed to by a symbolic link.
ja: シンボリックリンクによって指し示される項目のパスを返します。

source: Returns the path of the temporary directory for the current user.
ja: 現在のユーザのための一時的ディレクトリのパスを返します。

source: Returns the path to a given user’s home directory.
ja: 与えられたユーザのホームディレクトリへのパスを返します。

source: Returns the path to either the user’s or application’s home directory, depending on the platform.
ja: ユーザのまたはアプリケーションどちらかのホームディレクトリを返します、プラットホームに依存します。

source: Returns the plug-in selection color.
ja: プラグイン選択カラーを返します。

source: Returns the range in the string of the composed character sequences for a given range.
ja: 与えられた範囲に対する合成文字シーケンスの文字列での範囲を返します。

source: Returns the range of absolute time values that a smaller calendar component (such as a day) can take on in a larger calendar component (such as a month) that includes a specified absolute time.
ja: 指定された絶対時間を含むあるより大きいカレンダー構成要素（例えば月）の中で、あるより小さいカレンダー構成要素（例えば日にち）が取ることができる絶対時間値からなる範囲を返します。

source: Returns the range of characters representing the line or lines containing a given range.
ja: 与えられた範囲を含んでいる行または複数行を表している文字の範囲を返します。

source: Returns the range of characters representing the paragraph or paragraphs containing a given range.
ja: 与えられた範囲を含んでいる段落または複数段落を表している文字の範囲を返します。

source: Returns the range of the first match of the regular expression within the specified range of the string.
ja: この文字列の指定の範囲内における正規表現の最初のマッチの範囲を返します。

source: Returns the range of the next weekend via two inout parameters.
ja: 次の週末の範囲を２つのインアウトパラメータ経由で返します。

source: Returns the range of the result that the receiver represents.
ja: レシーバが表す結果の範囲を返します

source: Returns the receiver.
ja: レシーバを返します。

source: Returns the receiver’s descriptor for the specified keyword.
ja: レシーバの持つ記述子を指定されたキーワードに対して返します。

source: Returns the regular expression pattern.
ja: 正規表現パターンを返します。

source: Returns the result of combining the elements of the sequence using the given closure.
ja: シーケンスの要素を与えられたクロージャを使って結合する結果を返します。

source: Returns the result type that the range represents.
ja: 範囲が表すものの結果型を返します。

source: Returns the root directory of the user’s system.
ja: ユーザシステムのルートディレクトリを返します。

source: Returns the selector with a given name.
ja: 与えられた名前を持つセレクタを返します。

source: Returns the services provided by the File Provider extension that manages the item at the given URL.
ja: 与えられたURLで項目を管理する「ファイルプロバイダ」拡張によって提供されるサービスを返します。

source: Returns the shared NSScript Coercion Handler for the application.
ja: そのアプリケーションに共有されるNSScript Coercion Handlerを返します。

source: Returns the shared cookie storage instance.
ja: 共有クッキーストレージインスタンスを返します。

source: Returns the shared file manager object for the process.
ja: プロセスに対する共有ファイルマネージャオブジェクトを返します。

source: Returns the single instance of NSApple Event Manager, creating it first if it doesn’t exist.
ja: NSApple Event Managerの唯一のインスタンスを返します、それが存在しないならばそれを最初に作成します。

source: Returns the smallest rectangle that completely encloses both a Rect and b Rect.
ja: a Rectとb Rectの両方を完全に囲む、最も小さい矩形を返します。

source: Returns the smallest x coordinate of a given rectangle.
ja: 与えられた矩形の最小のx座標を返します。

source: Returns the smallest y coordinate of a given rectangle.
ja: 与えられた矩形の最小のy座標を返します。

source: Returns the specified number of bytes rounded down to a multiple of the page size.
ja: 指定されたバイト数を返します、ページサイズの倍数に端数を切り下げられます。

source: Returns the specified number of bytes rounded up to a multiple of the page size.
ja: 指定されたバイト数を返します、ページサイズの倍数に端数を切り上げられます。

source: Returns the specified object’s reference count.
ja: 指定されたオブジェクトの持つ参照カウントを返します。

source: Returns the starting time and duration of a given calendar component that contains a given date.
ja: 開始時間と与えられたカレンダー構成要素の継続期間を返します、それは与えられた日付を含みます。（開始時間が与えられた日付？）

source: Returns the sum of the location and length of the range.
ja: 範囲の位置と長さの合計を返します。

source: Returns the syntax-highlighted source code of the receiver if the receiver has been compiled and its source code is available.
ja: レシーバがコンパイルされてそれのソースコードが利用可能ならば、シンタックスハイライトされたレシーバのソースコードを返します。

source: Returns the temporary directory for the current user.
ja: 現在のユーザの一時的ディレクトリを返します。

source: Returns the text checking result type that the receiver represents.
ja: レシーバが表しているテキストチェックの結果型を返します。

source: Returns the top-level error handler.
ja: トップレベルのエラーハンドラを返します。

source: Returns the union of the specified ranges.
ja: 指定された範囲それらの和集合を返します。

source: Returns the unit converter used to represent the unit in terms of the dimension’s base unit.
ja: 寸法の持つ基本単位に基づいて単位を表すために使われる単位コンバータを返します。

source: Returns the unit string based on the provided value and unit.
ja: 提供された値と単位に基づく単位文字列を返します。

source: Returns the unit string for the provided value.
ja: 提供された値に対する単位文字列を返します。

source: Returns the value associated with the specified key in the receiver's information property list.
ja: レシーバの持つ情報プロパティリストの中の指定されたキーと結びつけられた値を返します。

source: Returns the value for one component of a date.
ja: ある日付の１つの構成要素に対する値を返します。

source: Returns the value of one of the properties, using an enumeration value instead of a property name.
ja: プロパティの１つの値を返します、プロパティ名ではなく列挙値を使っています。

source: Returns the value of the receiver's parameterized attribute corresponding to the specified attribute name and parameter.
ja: 指定された属性名とパラメータに対応する、レシーバの持つパラメータ化された属性の値を返します。

source: Returns the value of the specified attribute in the receiver.
ja: レシーバにおける指定された属性の値を返します。

source: Returns the version number assigned to the class.
ja: そのクラスに割り当てられたバージョン数を返します。

source: Returns the width of the specified rectangle.
ja: 指定された矩形の幅を返します。

source: Returns the x coordinate of a given rectangle’s midpoint.
ja: 与えられた矩形の中心点のx座標を返します。

source: Returns the x coordinate of the center of a Rect.
ja: a Rectの中心の x 座標を返します。

source: Returns the y coordinate of a given rectangle’s midpoint.
ja: 与えられた矩形の中心点のy座標を返します。

source: Returns true if self is a superset of other.
ja: selfがotherの上位集合ならばtrueを返します。

source: Returns true if the Character Set has a member in the specified plane.
ja: Character Setが指定された水準でのメンバを持つならばtrueを返します。

source: Returns true if the two Character Sets are equal.
ja: ２つのCharacter Setが等しいならばtrueを返します。

source: Returns whether the resource pointed to by a file URL can be reached.
ja: ファイルURLによって指し示されるリソースが獲得できるかどうかを返します。

source: Returns zero otherwise.
ja: ゼロをそうでなければ返します。

source: Returns, for a given absolute time, the ordinal number of a smaller calendar component (such as a day) within a specified larger calendar component (such as a week).
ja: 与えられた絶対時間に対して、指定されたより大きいカレンダー構成要素（例えば週）内のより小さいカレンダー構成要素（例えば日にち）の順序数を返します。

source: Returns, via two inout parameters, the starting time and duration of a given calendar component that contains a given date.
ja: ２つのインアウトパラメータ経由で、開始時間と与えられたカレンダー構成要素の継続期間を返します、それは与えられた日付を含みます。（開始時間が与えられた日付？）

source: Reverses the elements of the collection in place.
ja: コレクションの要素をその場で逆順にします。

source: Rounding
ja: 丸め

source: Rounds number off according to the parameters scale and rounding Mode and stores the result in result.
ja: numberをパラメータscaleとrounding Modeに従って丸めて、結果をresultに格納します。

source: Rounds off the decimal value.
ja: 10進法値を丸めます。

source: Run Loop Considerations
ja: 実行ループ考察

source: Sandboxed apps can send notifications only if they do not contain a dictionary.
ja: サンドボックスされたアプリは、通知をそれが辞書を含まない場合にのみ送ることができます。

source: Sandboxed apps in macOS and all apps in iOS that need to share files with other apps from the same developer on a given device use the com .apple .security .application-groups entitlement to join one or more application groups.
ja: macOSでのサンドボックスアプリとiOSでのすべてのアプリで、ある与えられたデバイス上で同じ開発者からの他のアプリとファイルを共有する必要があるものは、com .apple .security .application-groups資格を使って１つ以上のアプリケーショングループに参加します。

source: Scaling, rotation, and translation are the most commonly used manipulations supported by affine transforms, but shearing is also possible.
ja: 拡大縮小、回転、そして平行移動は、アフィン変換によってサポートされる操作でもっとも普通に使われます、しかし剪断変形もまた可能です。

source: Scanning Dates
ja: 日付を走査する

source: Scans a String for four numbers which are used as the x and y coordinates and the width and height, in that order, to create an NSPoint object.
ja: a Stringを走査してxとy座標そして幅と高さとして使われる４つの数字を、その順序で探して、NSPointオブジェクトを作成します。

source: Scans a String for two integers which are used as the location and length values, in that order, to create an NSRange struct.
ja: a Stringを走査して位置と長さの値として使われる２つの整数を、その順序で、探して、NSRange構造体を作成します。

source: Scans a String for two numbers which are used as the width and height, in that order, to create an NSSize struct.
ja: a Stringを走査して幅と高さとして使われる２つの数字を、その順序で、探して、NSSize構造体を作成します。

source: Script Commands
ja: スクリプトコマンド

source: Script Dictionary Description
ja: スクリプト用語説明記述

source: Script Execution
ja: スクリプト執行

source: Scriptable Cocoa applications frequently work with instances of NSApple Event Descriptor, but should rarely need to work directly with the AEDesc data structure.
ja: スクリプト対応のCocoaアプリケーションは、しばしばNSApple Event Descriptorのインスタンスを扱います、しかし直接にAEDescデータ構造体を扱う必要は滅多にありません。

source: Scripting
ja: スクリプトを書く

source: Scripting Support
ja: スクリプティングサポート

source: Scripts and External Tasks
ja: スクリプトと外部タスク

source: Scrolls screen content in an application-specific way and returns the success or failure of the action.
ja: 画面内容をそのアプリケーション特有の方法でスクロールします、そしてそのアクションの成功または失敗を返します。

source: Search for a date earlier in time than the start date.
ja: 開始日付より時間でさらに前の日付を検索します。

source: Search for a date later in time than the start date.
ja: 開始日付より時間でさらに後の日付を検索します。

source: Search for files and other items on the local device, and index your app's content for searching.
ja: ローカルデバイス上のファイルや他の項目を検索します、そしてあなたのアプリのもつ内容を検索のために索引化します。

source: Search path domain constants specifying base locations for the File Manager .Search Path Directory type.
ja: File Manager .Search Path Directory型に対する起点位置を指定する検索パス領域定数。

source: Searching Strings Using Regular Expressions
ja: 正規表現を使った文字列検索

source: See Byte Count Formatter .Count Style for possible values.
ja: Byte Count Formatter .Count Styleを可能な値のために見てください。

source: See Distributed Notification Center .Suspension Behavior for details on how the receiver delivers notifications to their observers when normal notification delivery is suspended.
ja: Distributed Notification Center .Suspension Behaviorを、通常の通知配達が待機させられる時、どのようにレシーバが通知をそれらのオブザーバに配達するかの詳細として見てください。

source: See ISO8601Date Formatter .Options for possible values.
ja: 可能な値にためにISO8601Date Formatter .Optionsを見てください。

source: See NSCalendar for more information.
ja: NSCalendarをさらなる情報として見てください。

source: See NSRegular Expression .Matching Flags for the possible values.
ja: 可能な値のためにNSRegular Expression .Matching Flagsを見てください。

source: See NSRegular Expression .Matching Options for possible values.
ja: NSRegular Expression .Matching Optionsを可能な値のために見てください。

source: See NSRegular Expression .Matching Options for the supported values.
ja: NSRegular Expression .Matching Optionsを支持される値のために見てください。

source: See NSRegular Expression .Options for a complete discussion of the possible constants and their meanings.
ja: 可能な定数とそれらの意味の完全な議論のためにNSRegular Expression .Optionsを見てください。

source: See NSRegular Expression .Options for possible values.
ja: NSRegular Expression .Optionsを可能な値のために見てください。

source: See NSRegular Expression Options for possible values.
ja: NSRegular Expression Optionsを可能な値のために見てください。

source: See NSSort Descriptor for additional information.
ja: さらなる情報としてNSSort Descriptorを見てください。

source: See accept Connection In Background And Notify() for details of how this method operates.
ja: accept Connection In Background And Notify()をこのメソッドを操作する方法の詳細として見てください。

source: See anchors Match Lines and the \m character expression in Table 4.
ja: anchors Match Linesと\m文字表現を表 4で見てください。

source: See anchors Match Lines and the m character expression in Table 4.
ja: anchors Match Linesとm文字表現を表 4で見てください。

source: See dot Matches Line Separators and the s character expression in Table 4.
ja: dot Matches Line Separatorsとs文字表現を表 4で見てください。

source: See enumerate Matches(in: options: range: using:) for a description of the constant in context.
ja: 前後関係におけるこの定数の説明としてenumerate Matches(in: options: range: using:)を見てください。

source: See init(properties:) for more information on the constraints imposed on the properties dictionary.
ja: init(properties:)を、properties辞書に課せられる制約に関するさらなる情報として見てください。

source: See read In Background And Notify() for details of how this method operates.
ja: read In Background And Notify()をこのメソッドを操作する方法の詳細として見てください。

source: See read To End Of File In Background And Notify() for details of this method's operation.
ja: read To End Of File In Background And Notify()をこのメソッドの持つ演算の詳細として見てください。

source: See Accessing File Wrapper Identities in File System Programming Guide for more information about the file-wrapper list structure.
ja: ファイルラッパーリスト構造についてのさらなる情報としてAccessing File Wrapper IdentitiesをFile System Programming Guideで見てください。

source: See Accessing File Wrapper Identities in File System Programming Guide for more information.
ja: Accessing File Wrapper IdentitiesをFile System Programming Guideにおいて、さらなる情報のために見てください。

source: See Constants for more information on the available cookie attribute constants and the constraints imposed on the values in the dictionary.
ja: 利用可能なクッキー属性定数に、そして辞書の中の値に課せられる制約に関するさらなる情報としてConstantsを見てください。

source: See Data Formatting Guide for a list of the conversion specifiers permitted in date format strings.
ja: Data Formatting Guideを日付書式設定文字列において許可される変換指定子のリストのために見てください。

source: See Flag Options for the format of template.
ja: フラグ・オプションをtemplateの書式のために見てください。

source: See Flag Options for the format of the resulting template string.
ja: 結果となるテンプレート文字列の書式のためにFlag Optionsを見てください。

source: See RFC 2616 for a list of commonly used HTTP header fields.
ja: RFC 2616 を一般的に使われるHTTPヘッダフィールドの一覧として見てください。

source: See RFC 2616 for details.
ja: RFC 2616を詳細として見てください。

source: See String Programming Guide for more information.
ja: 文字列操作プログラミングガイドを更なる情報として見てください。

source: See NSRegular Expression .Matching Options for the significance of report Progress or report Completion.
ja: NSRegular Expression .Matching Optionsをreport Progressやreport Completionの有意性のために見てください。

source: See Toll-Free Bridging for more information.
ja: さらなる情報のためにToll-Free Bridgingを見てください。

source: See File Wrapper .Reading Options for possible values.
ja: File Wrapper .Reading Optionsを可能な値のために見てください。

source: See File Wrapper .Writing Options for possible values.
ja: File Wrapper .Writing Optionsを可能な値のために見てください。

source: See Formatter for possible values.
ja: Formatterを可能な値のために見てください。

source: See Security Overview for general guidance on secure coding practices.
ja: Security Overviewを安全なコーディング習慣での全般的な指針として見てください。

source: See Toll-Free Bridging for more information on toll-free bridging.
ja: トールフリーブリッジに関する更なる情報としてトールフリーブリッジを見てください。

source: See Notification Posting Behavior for details.
ja: Notification Posting Behaviorを詳細として見てください。

source: See File-System Attribute Keys for a description of the keys available in the dictionary.
ja: File-System Attribute Keysをこの辞書で利用可能なキーの記述のために見てください。

source: See Also
ja: 参照

source: See HFS File Types for possible values.
ja: HFS File Typesを可能な値として見てください。

source: See RFC 2965 for more detail.
ja: RFC 2965をさらなる詳細として見てください。

source: See XML Property Lists for details.
ja: XML Property Listsを詳細として見てください。

source: See also NSAppleScript Additions Reference in the Application Kit framework, which defines a method that returns the syntax-highlighted source code for a script.
ja: またNSAppleScript Additions ReferenceをApplication Kit frameworkにおいて見てください、それはあるスクリプトの強調表示構文のソースコードを返すメソッドを定義します。

source: See the File Manager method url(for: in: appropriate For: create:) for the preferred means of finding the correct temporary directory.
ja: File Managerのメソッドurl(for: in: appropriate For: create:)を現在の一時ディレクトリを見つける好ましい手段の為に見てください。

source: See the post Notification Name(_: object: user Info: deliver Immediately:) method, Suspending and Resuming Notification Delivery, and Distributed Notification Center .Suspension Behavior for details.
ja: post Notification Name(_: object: user Info: deliver Immediately:)メソッド、Suspending and Resuming Notification Delivery、そしてDistributed Notification Center .Suspension Behaviorを詳細として見てください。

source: See the description of the file Attributes(at Path: traverse Link:) method of File Manager for details on obtaining the attributes from the dictionary.
ja: File Managerのfile Attributes(at Path: traverse Link:)メソッドの解説を辞書から属性を取得する上での詳細として見てください。

source: See the man page for the chmod function (man 2 chmod) for an explanation.
ja: chmod function (man 2 chmod) のmanページを説明として見てください。

source: Seeking Within a File
ja: ファイルの内部をシークする

source: Selecting Bytes
ja: バイトを選択する

source: Selecting Elements
ja: 要素の選択

source: Selecting Indexes
ja: インデックスを選択する

source: Selecting Nodes
ja: ノードを選択する

source: Selector that specifies the message the receiver sends notification Observer to notify it of the notification posting.
ja: レシーバがnotification Observerに送ってそれを通知する、通知投函する、メッセージを指定するセレクタ。

source: Sender of the notification.
ja: 通知の送り手。

source: Sender to remove from the dispatch table.
ja: ディスパッチテーブルから除去する送り手。

source: Sending Messages
ja: メッセージ送信

source: Sending Messages to Elements
ja: 要素にメッセージを送る

source: Sending a result the range(at:) message and passing 0 is equivalent to [result range].
ja: ある結果にrange(at:)メッセージを0を渡して送ることは、[result range]に等しいです。

source: Sent after an assistive technology has removed its virtual focus from an accessibility element.
ja: ある支援技術がそれの仮想フォーカスをアクセシビリティ要素から削除してしまった後に送られます。

source: Sent after an assistive technology has set its virtual focus on the accessibility element.
ja: ある支援技術がそれの仮想フォーカスをアクセシビリティ要素に設定された後に送られます。

source: Sent after the iCloud (“ubiquity”) identity has changed.
ja: iCloud（「偏在」）身元が変更された後に送られます。

source: Sent to the delegate to request the property the action applies to.
ja: アクションを適用するプロパティを要求する伝言を委任先に送ります。

source: Serialized representation of a file wrapper in the format used for the NSFile Contents Pboard Type pasteboard type.
ja: NSFile Contents Pboard Typeペーストボード型に対して使われる形式でのあるファイルラッパーのシリアライズされた表現。

source: Serializing
ja: シリアライズ

source: Service Discovery
ja: サービスの発見

source: Session cookies (where the cookie object’s is Session Only method returns true) are local to a single process and are not shared.
ja: セッションクッキー（そこでクッキーオブジェクトの持つis Session Onlyメソッドはtrueを返します）は、ある単一のプロセスに対して局所的です、そして共有されません。

source: Set A is a strict subset of another set B if every member of A is also a member of B and B contains at least one element that is not a member of A.
ja: 集合Aがもう１つの集合Bの狭義の部分集合であるのは、AのすべてのメンバがまたBのメンバであり、Bが少なくとも１つのAのメンバではない要素を含む場合です。

source: Set A is a strict superset of another set B if every member of B is also a member of A and A contains at least one element that is not a member of B.
ja: 集合Aがもう１つの集合Bの狭義の上位集合であるのは、BのすべてのメンバがまたAのメンバであり、Aが少なくとも１つのBのメンバではない要素を含む場合です。

source: Set A is a subset of another set B if every member of A is also a member of B.
ja: 集合Aがもう１つの集合Bの狭義の部分集合であるのは、AのすべてのメンバがまたBのメンバである場合です。

source: Set A is a superset of another set B if every member of B is also a member of A.
ja: 集合Aがもう１つの集合Bの狭義の上位集合であるのは、BのすべてのメンバがまたAのメンバである場合です。

source: Set by the Block as the matching progresses, completes, or fails.
ja: 「ブロック」によってマッチングの進歩、完了、失敗につれて設定されます。

source: Set the connection’s remote Object Interface property, using the service’s protocol.
ja: 接続のremote Object Interfaceプロパティを、サービスのプロトコルを使って設定してください。

source: Set the value of one of the properties, using an enumeration value instead of a property name.
ja: プロパティの１つの値を設定します、プロパティ名ではなく列挙値を使っています。

source: Set this property to an appropriate value before generating string values.
ja: このプロパティを適切な値に設定してください、文字列値を生成する前にです。

source: Set to true if these components represent a leap month.
ja: それらの構成要素が閏月を表すならばtrueに設定されます。
